import Axios from '../utils/axios';
import { ChemicalForm, ChemicalInfo, ChemicalList, ChemicalParam, updateForm } from '../interface/chemical';

export const getChemicalList = async (param: ChemicalParam): Promise<ChemicalList> => {
    try {
        const res: ChemicalList = await Axios.get('/both/getChemicalList', {
            params: param
        });
        return res;
    }
    catch (error) {
        console.log(error);
        return {
            total: 43,
            data: [{
                "id": 48,
                "cn_name": "1,2-环氧丙烷",
                "en_name": "1,2-epoxypropane|propylene oxide|methyloxirane",
                "cn_alia": "氧化丙烯|甲基环氧乙烷",
                "cas": "75-56-9",
                "formula": "C3H6O",
                "emergency": "液体。极端易燃，有爆炸危险。对皮肤有刺激性。对眼睛有严重刺激性。对呼吸道有刺激作用。有轻微致癌性风险。",
                "danger_class": "易燃液体 类别 1,皮肤腐蚀/刺激 类别 2,严重眼损伤/眼刺激类别 2A,特异性靶器官毒性-一次接触：呼吸道刺激类别 3,生殖细胞致突变性 类别 1B,致癌性 类别 2",
                "other": "GHS02|GHS07|GHS08",
                "danger": "极易燃液体和蒸气,造成皮肤刺激,造成严重眼刺激,可能造成呼吸道刺激,可能造成遗传性缺陷,怀疑致癌",
                "prevent": "在使用前获取特别指示。在明白所有安全防范措施之前请勿搬动。远离热源/火花/明火/热表面。禁止吸烟。保持容器密闭。容器和接收设备接地/等势联接。使用防爆的电气/通风/照明等设备。只能使用不产生火花的工具。采取防止静电放电的措施。不要吸入粉尘/烟/气体/烟雾/蒸气/喷雾。作业后彻底清洗脸部及手部。只能在室外或通风良好之处使用。戴防护手套/穿防护服/戴防护眼罩/戴防护面具。",
                "response": "如感觉不适，呼叫解毒中心或医生。具体治疗（见本标签上的……）。如误吸入：将受害人转移到空气新鲜处，保持呼吸舒适的休息姿势。如接触到或有疑虑：求医/就诊。如发生皮肤刺激：求医/就诊。如仍觉眼刺激：求医/就诊。脱掉所有沾染的衣服，清洗后方可重新使用。火灾时：使用本报告第五部分提及的合适的灭火介质灭火。如皮肤(或头发)沾染：立即去除/脱掉所有沾染的衣服。用水清洗皮肤/淋浴。如进入眼睛：用水小心冲洗几分钟。如戴隐形眼镜并可方便地取出，取出隐形眼镜。继续冲洗。",
                "store": "存放处须加锁。存放在通风良好的地方。保持容器密闭。存放在通风良好的地方。保持低温。",
                "disposal_overview": "按照地方/区域/国家/国际规章处置内装物/容器。",
                "physical_chemical": "极端易燃液体，有爆炸危险。",
                "health": "咳嗽。咽喉痛。咽喉疼痛。发红。发红。疼痛。",
                "environment": "请参阅SDS第十二部分。",
                "first_aid": "急救措施通常是需要的，请将本SDS出示给到达现场的医生。",
                "eye_touch": "用大量水冲洗(如可能易行，摘除隐形眼镜)。给与医疗护理。",
                "skin_touch": "脱去污染的衣服。用大量水冲洗皮肤或淋浴。",
                "eat": "漱口。不要催吐。如果呼吸困难和/或发烧，就医。",
                "breath": "新鲜空气，休息。如果感觉不舒服，需就医。",
                "advice": "确保医护人员了解产品的危害特性，并采取自身防护措施，以保护自己和防止污染传播。",
                "doctor": "清除所有火源，增强通风。避免接触皮肤和眼睛。避免吸入蒸气。使用防护装备,包括呼吸面具。",
                "danger_properties": "根据出现的症状进行针对性处理。注意症状可能会出现延迟。",
                "fire_stuff": "可与空气形成爆炸性混合物 。暴露于火中的容器可能会通过压力安全阀泄漏出内容物，从而增加火势和/或蒸气的浓度。蒸气可能会移动到着火源并回闪。液体和蒸气易燃。加热时，容器可能爆炸。受热或接触火焰可能会产生膨胀或爆炸性分解。",
                "fire_step": "无特别说明。",
                "environment_step": "避免吸入蒸气、接触皮肤和眼睛。谨防蒸气积累达到可爆炸的浓度。蒸气能在低洼处积聚。建议应急人员戴正压自给式呼吸器，穿防毒、防静电服，戴化学防渗透手套。保证充分的通风。清除所有点火源。采取防静电措施。迅速将人员撤离到安全区域，远离泄漏区域并处于上风方向。使用个人防护装备。避免吸入蒸气、烟雾、气体或风尘。",
                "store_attention": "保持容器密闭。储存在干燥、阴凉和通风处。远离热源、火花、明火和热表面。存储于远离不相容材料和食品容器的地方。",
                "eye_protect": "佩戴化学护目镜（符合欧盟EN 166或美国NIOSH标准）。",
                "hand_protect": "戴化学防护手套（例如丁基橡胶手套）。建议选择经过欧盟EN 374、美国US F739或AS/NZS 2161.1标准测试的防护手套。",
                "breath_protect": "如果蒸气浓度超过职业接触限值或发生刺激等症状时，请使用全面罩式多功能防毒面具（US）或AXBEK型（EN 14387）防毒面具筒。",
                "skin_protect": "穿阻燃防静电防护服和抗静电的防护靴。",
                "look": "无色液体",
                "ph": "无资料",
                "smell": "轻微气味",
                "fei": "34",
                "rong": "-112",
                "sky": "2.0",
                "kpa": "59kPa（20℃ ）",
                "water": "0.83（20℃）",
                "mm2": "0.374（20℃）",
                "shan": "-37",
                "xinchun": "0.03",
                "fenjie": "无资料",
                "yinran": "430",
                "baozha": "上限：36.3；下限：1.9",
                "rongjie": "与水混溶",
                "yiran": "极易燃",
                "stability": "在正确的使用和存储条件下是稳定的。",
                "avoid": "不相容物质，热、火焰和火花。",
                "apart": "在正常的储存和使用条件下，不会产生危险的分解产物。",
                "disposal": "处置之前应参阅国家和地方有关法规。建议用焚烧法处置。",
                "disposal2": "包装物清空后仍可能存在残留物危害，应远离热和火源，如有可能返还给供应商循环使用。",
                "disposal_attention": "请参阅13.1和13.2。",
                "trans_attention": "装运该物品的车辆排气管必须配备阻火装置，禁止使用易产生火花的机械设备和工具装卸。运输途中应防曝晒、雨淋，防高温。运输时所用的槽（罐）车应有接地链，槽内可设孔隔板以减少震荡产生静电。严禁与氧化剂、酸类、食品及食品添加剂等混装混运。严禁用木船、水泥船散装运输。运输时运输车辆应配备相应品种和数量的消防器材及泄漏应急处理设备。运输前应先检查包装容器是否完整、密封。运输工具上应根据相关运输要求张贴危险标志、公告。",
                "book1": 1,
                "book2": 0,
                "book3": 0,
                "book4": 0,
                "book5": 1,
                "book6": 0,
                "book7": 0,
                "book8": 0,
                "step_attention2": "避免吸入蒸气。只能使用不产生火花的工具。为防止静电释放引起的蒸气着火，设备上所有金属部件都要接地。使用防爆设备。在通风良好处进行操作。穿戴合适的个人防护用具。避免接触皮肤和进入眼睛。远离热源、火花、明火和热表面。",
                "eng_control": "保持充分的通风，特别在封闭区内。确保在工作场所附近有洗眼和淋浴设施。使用防爆电器、通风、照明等设备。设置应急撤离通道和必要的泄险区。",
                "danger_act": "与无机酸或高氯酸镁接触发生爆炸。",
                "no_rong": "无机酸、共价卤化物、无机碱、胺、金属烷氧化物、金属氧化物和高氯酸镁。",
                "step_attention": "少量泄漏时，可采用干砂或惰性吸附材料吸收泄漏物，大量泄漏时需筑堤控制。附着物或收集物应存放在合适的密闭容器中，并根据当地相关法律法规废弃处置。清除所有点火源，并采用防火花工具和防暴设备。",
                "not_fire_stuff": "使用适合火灾类型的合适的灭火剂。",
                "protective_step": "灭火时，应佩戴呼吸面具（(符合MSHA/NIOSH要求的或相当的)）并穿上全身防护服。在安全距离处、有充足防护的情况下灭火。防止消防水污染地表和地下水系统。",
                "leak_method": "在确保安全的情况下，采取措施防止进一步的泄漏或溢出。避免排放到周围环境中。"
            }, {
                "id": 49,
                "cn_name": "苯乙烯[稳定的]",
                "en_name": "styrene,stabilized|vinyl benzene",
                "cn_alia": "乙烯苯",
                "cas": "100-42-5",
                "formula": "C8H8",
                "emergency": "液体。易燃,其蒸气与空气混合，能形成爆炸性混合物。对皮肤有刺激性。对眼睛有严重刺激性。有轻微致癌性风险。可能有损伤胎儿或胚胎的危险。长期暴露有严重损伤健康的危险。对水生物有毒。",
                "danger_class": "特异性靶器官毒性-反复接触 类别 1,对水生环境的危害-急性危害类别 2,易燃液体 类别 3,皮肤腐蚀/刺激 类别 2,严重眼损伤/眼刺激类别 2A,致癌性 类别 2,生殖毒性 类别 2",
                "other": "GHS02|GHS07|GHS08",
                "danger": "怀疑对生育能力或胎儿造成伤害,长期或反复接触会对器官造成损害,对水生生物有毒,易燃液体和蒸气,造成皮肤刺激,造成严重眼刺激,怀疑致癌",
                "prevent": "在使用前获取特别指示。在明白所有安全防范措施之前请勿搬动。远离热源/火花/明火/热表面。禁止吸烟。保持容器密闭。容器和接收设备接地/等势联接。使用防爆的电气/通风/照明等设备。只能使用不产生火花的工具。采取防止静电放电的措施。不要吸入粉尘/烟/气体/烟雾/蒸气/喷雾。作业后彻底清洗脸部及手部。使用本产品时不要进食、饮水或吸烟。避免释放到环境中。戴防护手套/穿防护服/戴防护眼罩/戴防护面具。",
                "response": "如感觉不适，须求医/就诊。具体治疗（见本标签上的……）。如接触到或有疑虑：求医/就诊。如发生皮肤刺激：求医/就诊。如仍觉眼刺激：求医/就诊。脱掉所有沾染的衣服，清洗后方可重新使用。火灾时：使用本报告第五部分提及的合适的灭火介质灭火。如皮肤(或头发)沾染：立即去除/脱掉所有沾染的衣服。用水清洗皮肤/淋浴。如进入眼睛：用水小心冲洗几分钟。如戴隐形眼镜并可方便地取出，取出隐形眼镜。继续冲洗。",
                "store": "存放处须加锁。存放在通风良好的地方。保持低温。",
                "disposal_overview": "按照地方/区域/国家/国际规章处置内装物/容器。",
                "physical_chemical": "易燃液体，其蒸气与空气混合，能形成爆炸性混合物。",
                "health": "头晕。倦睡。头痛。恶心。呕吐。虚弱。神志不清。恶心。呕吐。发红。疼痛。发红。疼痛。",
                "environment": "本品对水生生物有毒。请参阅SDS第十二部分。",
                "first_aid": "急救措施通常是需要的，请将本SDS出示给到达现场的医生。",
                "eye_touch": "先用大量水冲洗几分钟(如可能易行，摘除隐形眼镜)，然后就医。",
                "skin_touch": "脱去污染的衣服,冲洗,然后用水和肥皂清洗皮肤。",
                "eat": "漱口。不要催吐。大量饮水。休息。",
                "breath": "新鲜空气，休息。给予医疗护理。",
                "advice": "确保医护人员了解产品的危害特性，并采取自身防护措施，以保护自己和防止污染传播。",
                "doctor": "清除所有火源，增强通风。避免接触皮肤和眼睛。避免吸入蒸气。使用防护装备,包括呼吸面具。",
                "danger_properties": "根据出现的症状进行针对性处理。注意症状可能会出现延迟。",
                "fire_stuff": "可与空气形成爆炸性混合物 。暴露于火中的容器可能会通过压力安全阀泄漏出内容物，从而增加火势和/或蒸气的浓度。蒸气可能会移动到着火源并回闪。液体和蒸气易燃。加热时，容器可能爆炸。受热或接触火焰可能会产生膨胀或爆炸性分解。",
                "fire_step": "无特别说明。",
                "environment_step": "避免吸入蒸气、接触皮肤和眼睛。谨防蒸气积累达到可爆炸的浓度。蒸气能在低洼处积聚。建议应急人员戴正压自给式呼吸器，穿防毒、防静电服，戴化学防渗透手套。保证充分的通风。清除所有点火源。采取防静电措施。迅速将人员撤离到安全区域，远离泄漏区域并处于上风方向。使用个人防护装备。避免吸入蒸气、烟雾、气体或风尘。",
                "store_attention": "保持容器密闭。储存在干燥、阴凉和通风处。远离热源、火花、明火和热表面。存储于远离不相容材料和食品容器的地方。",
                "eye_protect": "佩戴化学护目镜（符合欧盟EN 166或美国NIOSH标准）。",
                "hand_protect": "戴化学防护手套（例如丁基橡胶手套）。建议选择经过欧盟EN 374、美国US F739或AS/NZS 2161.1标准测试的防护手套。",
                "breath_protect": "如果蒸气浓度超过职业接触限值或发生刺激等症状时，请使用全面罩式多功能防毒面具（US）或AXBEK型（EN 14387）防毒面具筒。",
                "skin_protect": "穿阻燃防静电防护服和抗静电的防护靴。",
                "look": "无色油状液体",
                "ph": "无资料",
                "smell": "无资料",
                "fei": "145",
                "rong": "-30.6",
                "sky": "3.6",
                "kpa": "0.67kPa（20℃ ）",
                "water": "0.99（25℃）",
                "mm2": "无资料",
                "shan": "31",
                "xinchun": "3.0",
                "fenjie": "无资料",
                "yinran": "490",
                "baozha": "上限：6.8；下限：0.9",
                "rongjie": "不溶于水",
                "yiran": "易燃",
                "stability": "在正确的使用和存储条件下是稳定的。",
                "avoid": "不相容物质，热、火焰和火花。",
                "apart": "在正常的储存和使用条件下，不会产生危险的分解产物。",
                "disposal": "处置之前应参阅国家和地方有关法规。建议用焚烧法处置。",
                "disposal2": "包装物清空后仍可能存在残留物危害，应远离热和火源，如有可能返还给供应商循环使用。",
                "disposal_attention": "请参阅13.1和13.2。",
                "trans_attention": "装运该物品的车辆排气管必须配备阻火装置，禁止使用易产生火花的机械设备和工具装卸。运输途中应防曝晒、雨淋，防高温。运输时所用的槽（罐）车应有接地链，槽内可设孔隔板以减少震荡产生静电。严禁与氧化剂、酸类、食品及食品添加剂等混装混运。严禁用木船、水泥船散装运输。运输时运输车辆应配备相应品种和数量的消防器材及泄漏应急处理设备。运输前应先检查包装容器是否完整、密封。运输工具上应根据相关运输要求张贴危险标志、公告。",
                "book1": 1,
                "book2": 0,
                "book3": 0,
                "book4": 0,
                "book5": 1,
                "book6": 0,
                "book7": 0,
                "book8": 0,
                "not_fire_stuff": "使用适合火灾类型的合适的灭火剂。",
                "protective_step": "灭火时，应佩戴呼吸面具（(符合MSHA/NIOSH要求的或相当的)）并穿上全身防护服。在安全距离处、有充足防护的情况下灭火。防止消防水污染地表和地下水系统。",
                "leak_method": "在确保安全的情况下，采取措施防止进一步的泄漏或溢出。避免排放到周围环境中。",
                "step_attention": "少量泄漏时，可采用干砂或惰性吸附材料吸收泄漏物，大量泄漏时需筑堤控制。附着物或收集物应存放在合适的密闭容器中，并根据当地相关法律法规废弃处置。清除所有点火源，并采用防火花工具和防暴设备。",
                "step_attention2": "避免吸入蒸气。只能使用不产生火花的工具。为防止静电释放引起的蒸气着火，设备上所有金属部件都要接地。使用防爆设备。在通风良好处进行操作。穿戴合适的个人防护用具。避免接触皮肤和进入眼睛。远离热源、火花、明火和热表面。",
                "eng_control": "保持充分的通风，特别在封闭区内。确保在工作场所附近有洗眼和淋浴设施。使用防爆电器、通风、照明等设备。设置应急撤离通道和必要的泄险区。",
                "danger_act": "可与卤化物发生活性反应。",
                "no_rong": "卤化物、氧化剂和卤素。"
            }]
        }
    }
}

export const addChemical = async(data: ChemicalInfo) => {
    try{
        await Axios.post('/web/addChemical', data);
    }
    catch(error){
        console.log(error);
    }
}

export const updateChemical = async(data: updateForm) => {
    try{
        await Axios.post('/web/editChemical', data);
    }
    catch(error){
        console.log(error);
    }
}

export const deleteChemical = async(id: number) => {
    try{
        await Axios.post('/web/deleteChemical', null, {
            params: {id}
        })
    }
    catch(error){
        console.log(error);
    }
}